app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-10-14 17:58:06.815308"], ["updated_at", "2018-10-14 17:58:06.815308"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-14 17:58:06.825981"], ["updated_at", "2018-10-14 17:58:06.825981"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:lead].path, headers: true) do |song|
      s = Song.create(:name => song[0])
      s.artist = Artist.find_or_create_by(:name => song[1])